cask "brave-browser"
cask "discord"
cask "docker-desktop"
cask "emacs-app"
cask "firefox"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "obs"
cask "scroll-reverser"
cask "sf-symbols"
cask "spotify"
cask "utm"
cask "visual-studio-code"
cask "whatsapp"
cask "xquartz"
