tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "peter-bread/gamon"
brew "highway"
brew "readline"
brew "sqlite"
brew "glib"
brew "bash"
brew "bat"
brew "cmake"
brew "cmake-docs"
brew "erlang"
brew "elixir"
brew "libgit2"
brew "eza"
brew "fd"
brew "pango"
brew "sdl2"
brew "svt-av1"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "libavif"
brew "gh"
brew "git"
brew "gleam"
brew "glow"
brew "gtk+3"
brew "gnu-apl"
brew "go"
brew "go-task"
brew "librsvg"
brew "graphviz"
brew "libheif"
brew "imagemagick"
brew "jc"
brew "jq"
brew "lazygit"
brew "lua"
brew "luajit"
brew "luarocks"
brew "make"
brew "mas"
brew "micro"
brew "mise"
brew "nano"
brew "nanorc"
brew "tree-sitter"
brew "neovim"
brew "openjdk"
brew "pandoc"
brew "pkg-config"
brew "poppler"
brew "pre-commit"
brew "pyenv"
brew "ripgrep"
brew "ruby"
brew "starship"
brew "stow"
brew "swift-format"
brew "texlive"
brew "tmux"
brew "tokei"
brew "tree"
brew "wget"
brew "yazi"
brew "yq"
brew "z3"
brew "zig"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "peter-bread/gamon/gamon"
cask "brave-browser"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lilex-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kitty"
cask "notion"
cask "scroll-reverser"
cask "sf-symbols"
cask "spotify"
cask "utm"
cask "visual-studio-code"
cask "webex"
cask "wezterm"
cask "whatsapp"
cask "xquartz"
cask "zed"
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "haskell.haskell"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "httpsterio.henna"
vscode "jakebecker.elixir-ls"
vscode "johnpapa.vscode-peacock"
vscode "justusadam.language-haskell"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sumneko.lua"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "yzhang.markdown-all-in-one"
