tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "peter-bread/gamon"

brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gamon"
brew "gcc"
brew "gh"
brew "git"
brew "jq"
brew "lua"
brew "luajit"
brew "mise"
brew "tree-sitter"
brew "neovim"
brew "pkg-config"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
brew "yq"

cask "brave-browser"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "jetbrains-toolbox"
cask "sf-symbols"
cask "spotify"
cask "visual-studio-code"
cask "wezterm"

brew "mas"

mas "Microsoft Outlook", id: 985367838

